<template>
<div class="body">
    <div class="main_frame">
        <div class="top_half">
            <div class="balance">
                <div class="balance_text">Текущий баланс</div>
                <div class="balance_number"><span>154 000,<span class="digit_color">00</span></span> Руб.</div> 
            </div>

            <div class="currency_balance">
                <div class="currency_balance_text">Баланс в валюте</div>
                <div class="currency_balance_usd"><span>2 439,52</span> Дол.</div>
                <div class="currency_balance_eur"><span>2 542,93</span> Евр.</div>
            </div>

            <div class="currency_button">                
                <svg class="eye_svg" viewBox="-10 0 45 30" xmlns="http://www.w3.org/2000/svg">
                    <path d="M26 13C26 13 21.125 4.0625 13 4.0625C4.875 4.0625 0 13 0 13C0 13 4.875 21.9375 13 21.9375C21.125 21.9375 26 13 26 13ZM1.90612 13C2.69184 11.8058 3.59554 10.6936 4.60362 9.68012C6.695 7.5855 9.555 5.6875 13 5.6875C16.445 5.6875 19.3034 7.5855 21.398 9.68012C22.4061 10.6936 23.3098 11.8058 24.0955 13C24.0012 13.1414 23.8973 13.2974 23.7786 13.468C23.2343 14.248 22.4299 15.288 21.398 16.3199C19.3034 18.4145 16.4434 20.3125 13 20.3125C9.555 20.3125 6.69663 18.4145 4.602 16.3199C3.59392 15.3064 2.69022 14.1942 1.9045 13H1.90612Z" fill="white"/>
                    <path d="M13 8.9375C11.9226 8.9375 10.8892 9.36551 10.1274 10.1274C9.36551 10.8892 8.9375 11.9226 8.9375 13C8.9375 14.0774 9.36551 15.1108 10.1274 15.8726C10.8892 16.6345 11.9226 17.0625 13 17.0625C14.0774 17.0625 15.1108 16.6345 15.8726 15.8726C16.6345 15.1108 17.0625 14.0774 17.0625 13C17.0625 11.9226 16.6345 10.8892 15.8726 10.1274C15.1108 9.36551 14.0774 8.9375 13 8.9375ZM7.3125 13C7.3125 11.4916 7.91172 10.0449 8.97833 8.97833C10.0449 7.91172 11.4916 7.3125 13 7.3125C14.5084 7.3125 15.9551 7.91172 17.0217 8.97833C18.0883 10.0449 18.6875 11.4916 18.6875 13C18.6875 14.5084 18.0883 15.9551 17.0217 17.0217C15.9551 18.0883 14.5084 18.6875 13 18.6875C11.4916 18.6875 10.0449 18.0883 8.97833 17.0217C7.91172 15.9551 7.3125 14.5084 7.3125 13Z" fill="white"/>
                </svg>
                <svg class="pen_svg" viewBox="-10 0 45 30">
                    <path d="M22.2841 2.78875C22.4184 2.92348 22.4938 3.10595 22.4938 3.29619C22.4938 3.48642 22.4184 3.6689 22.2841 3.80363L20.7848 5.30438L17.9098 2.42938L19.4091 0.928626C19.5439 0.793881 19.7267 0.718185 19.9173 0.718185C20.1079 0.718185 20.2906 0.793881 20.4254 0.928626L22.2841 2.78731V2.78875ZM19.7685 6.31925L16.8935 3.44425L7.0998 13.2394C7.02068 13.3185 6.96112 13.415 6.92586 13.5211L5.76868 16.9912C5.74769 17.0545 5.74471 17.1224 5.76007 17.1872C5.77543 17.2521 5.80853 17.3114 5.85566 17.3585C5.90279 17.4057 5.96209 17.4387 6.02695 17.4541C6.09181 17.4695 6.15966 17.4665 6.22293 17.4455L9.69305 16.2883C9.79909 16.2535 9.89555 16.1944 9.9748 16.1158L19.7685 6.32069V6.31925Z" fill="white"/>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M1.4375 19.4062C1.4375 19.9781 1.66468 20.5266 2.06905 20.931C2.47343 21.3353 3.02188 21.5625 3.59375 21.5625H19.4062C19.9781 21.5625 20.5266 21.3353 20.931 20.931C21.3353 20.5266 21.5625 19.9781 21.5625 19.4062V10.7812C21.5625 10.5906 21.4868 10.4078 21.352 10.273C21.2172 10.1382 21.0344 10.0625 20.8438 10.0625C20.6531 10.0625 20.4703 10.1382 20.3355 10.273C20.2007 10.4078 20.125 10.5906 20.125 10.7812V19.4062C20.125 19.5969 20.0493 19.7797 19.9145 19.9145C19.7797 20.0493 19.5969 20.125 19.4062 20.125H3.59375C3.40313 20.125 3.22031 20.0493 3.08552 19.9145C2.95073 19.7797 2.875 19.5969 2.875 19.4062V3.59375C2.875 3.40313 2.95073 3.22031 3.08552 3.08552C3.22031 2.95073 3.40313 2.875 3.59375 2.875H12.9375C13.1281 2.875 13.3109 2.79927 13.4457 2.66448C13.5805 2.52969 13.6562 2.34687 13.6562 2.15625C13.6562 1.96563 13.5805 1.78281 13.4457 1.64802C13.3109 1.51323 13.1281 1.4375 12.9375 1.4375H3.59375C3.02188 1.4375 2.47343 1.66468 2.06905 2.06905C1.66468 2.47343 1.4375 3.02188 1.4375 3.59375V19.4062Z" fill="white"/>
                </svg>                
                <span class="currency_button_left">В валюте</span>                
                <span class="currency_button_right">Остаток</span>   
            </div>
        </div>

        <div class="bottom_half">
            <div class="manipulating_buttons">
                <div class="planning_button">план</div>
                <div class="upside_button">                    
                    <svg class="arrow_down" viewBox="0 0 35 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g clip-path="url(#clip0_4_318)">
                            <path d="M16 8C16 10.1217 15.1571 12.1566 13.6569 13.6569C12.1566 15.1571 10.1217 16 8 16C5.87827 16 3.84344 15.1571 2.34315 13.6569C0.842855 12.1566 0 10.1217 0 8C0 5.87827 0.842855 3.84344 2.34315 2.34315C3.84344 0.842855 5.87827 0 8 0C10.1217 0 12.1566 0.842855 13.6569 2.34315C15.1571 3.84344 16 5.87827 16 8ZM8.5 4.5C8.5 4.36739 8.44732 4.24021 8.35355 4.14645C8.25979 4.05268 8.13261 4 8 4C7.86739 4 7.74021 4.05268 7.64645 4.14645C7.55268 4.24021 7.5 4.36739 7.5 4.5V10.293L5.354 8.146C5.26011 8.05211 5.13278 7.99937 5 7.99937C4.86722 7.99937 4.73989 8.05211 4.646 8.146C4.55211 8.23989 4.49937 8.36722 4.49937 8.5C4.49937 8.63278 4.55211 8.76011 4.646 8.854L7.646 11.854C7.69245 11.9006 7.74762 11.9375 7.80837 11.9627C7.86911 11.9879 7.93423 12.0009 8 12.0009C8.06577 12.0009 8.13089 11.9879 8.19163 11.9627C8.25238 11.9375 8.30755 11.9006 8.354 11.854L11.354 8.854C11.4479 8.76011 11.5006 8.63278 11.5006 8.5C11.5006 8.36722 11.4479 8.23989 11.354 8.146C11.2601 8.05211 11.1328 7.99937 11 7.99937C10.8672 7.99937 10.7399 8.05211 10.646 8.146L8.5 10.293V4.5Z" fill="white"/>
                        </g>
                        <defs>
                            <clipPath id="clip0_4_318">
                                <rect width="16" height="16" fill="white"/>
                            </clipPath>
                        </defs>
                    </svg>                        
                </div>
                <div class="downside_button">
                    <svg class="arrow_up" viewBox="0 0 35 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g clip-path="url(#clip0_4_320)">
                            <path d="M16 8C16 5.87827 15.1571 3.84344 13.6569 2.34315C12.1566 0.842855 10.1217 0 8 0C5.87827 0 3.84344 0.842855 2.34315 2.34315C0.842855 3.84344 0 5.87827 0 8C0 10.1217 0.842855 12.1566 2.34315 13.6569C3.84344 15.1571 5.87827 16 8 16C10.1217 16 12.1566 15.1571 13.6569 13.6569C15.1571 12.1566 16 10.1217 16 8ZM8.5 11.5C8.5 11.6326 8.44732 11.7598 8.35355 11.8536C8.25979 11.9473 8.13261 12 8 12C7.86739 12 7.74021 11.9473 7.64645 11.8536C7.55268 11.7598 7.5 11.6326 7.5 11.5V5.707L5.354 7.854C5.26011 7.94789 5.13278 8.00063 5 8.00063C4.86722 8.00063 4.73989 7.94789 4.646 7.854C4.55211 7.76011 4.49937 7.63278 4.49937 7.5C4.49937 7.36722 4.55211 7.23989 4.646 7.146L7.646 4.146C7.69245 4.09944 7.74762 4.06249 7.80837 4.03729C7.86911 4.01208 7.93423 3.99911 8 3.99911C8.06577 3.99911 8.13089 4.01208 8.19163 4.03729C8.25238 4.06249 8.30755 4.09944 8.354 4.146L11.354 7.146C11.4479 7.23989 11.5006 7.36722 11.5006 7.5C11.5006 7.63278 11.4479 7.76011 11.354 7.854C11.2601 7.94789 11.1328 8.00063 11 8.00063C10.8672 8.00063 10.7399 7.94789 10.646 7.854L8.5 5.707V11.5Z" fill="white"/>
                        </g>
                        <defs>
                            <clipPath id="clip0_4_320">
                                <rect width="60" height="60" fill="white"/>
                            </clipPath>
                        </defs>
                    </svg>
                </div>
                <div class="cash">наличка</div>
                <div class="non-cash">безнал</div>
            </div>     
            
            <div class="last_operations_list">
              <div v-for="cassaOperation in cassaOperationsView" v-bind:key="cassaOperation.$Id">
              <CassaOperation :storeName=cassaOperation.name 
                                storeAdress="пр. Братьев Коростылёвых" 
                                totalCost="7777,77">
                </CassaOperation>
              </div>  
                <CassaOperation storeName="Оплата заправки" 
                                storeAdress="ул. Пушкина, дом Колотушкина" 
                                totalCost="5000">
                </CassaOperation>
                <CassaOperation></CassaOperation>
                <CassaOperation></CassaOperation>
                <CassaOperation></CassaOperation>
                <CassaOperation></CassaOperation>
                <CassaOperation></CassaOperation>
                <CassaOperation></CassaOperation>
                <CassaOperation></CassaOperation>
                <CassaOperation></CassaOperation>
                <CassaOperation></CassaOperation>
                <CassaOperation></CassaOperation>
                <CassaOperation></CassaOperation>
                <CassaOperation></CassaOperation>
                <CassaOperation></CassaOperation>
            </div>

            <div class="bottom_panel">
                <div class="stats_text">15 операций за неделю</div>
                <div @click="openCassaList()" class="list_of_bills">Список счетов</div>
                <div @click="switchModalAdd()" class="add_operation">Добавить операцию</div>
            </div>
        </div>
    </div>
      <!-- Модальное окно добавления операции -->
  <ModalWindow
  v-if="isModalAddOperationVisible" 
  v-click-outside="switchModalAdd" 
  modal_header_title="Добавление новой операции"
  >
  <div class="modal_divName"><input class="modal_inputall" placeholder="Название операции" type="text"></div>
  <div class="modal_divName"><input class="modal_inputall" placeholder="Сумма операции" type="text"></div>
  <div class="modal_adress">
    <div class="modal_divadress"><input class="modal_inputall" placeholder="Адрес или описание" type="text"></div>
      <div class="modal_divadressmark">
        <svg width="20" height="1" viewBox="0 0 19 25" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M9.5 25C9.5 25 18.875 16.1156 18.875 9.375C18.875 6.8886 17.8873 4.50403 16.1291 2.74587C14.371 0.98772 11.9864 0 9.5 0C7.0136 0 4.62903 0.98772 2.87087 2.74587C1.11272 4.50403 0.125 6.8886 0.125 9.375C0.125 16.1156 9.5 25 9.5 25ZM9.5 14.0625C8.2568 14.0625 7.06451 13.5686 6.18544 12.6896C5.30636 11.8105 4.8125 10.6182 4.8125 9.375C4.8125 8.1318 5.30636 6.93951 6.18544 6.06044C7.06451 5.18136 8.2568 4.6875 9.5 4.6875C10.7432 4.6875 11.9355 5.18136 12.8146 6.06044C13.6936 6.93951 14.1875 8.1318 14.1875 9.375C14.1875 10.6182 13.6936 11.8105 12.8146 12.6896C11.9355 13.5686 10.7432 14.0625 9.5 14.0625Z" fill="black"/>
        </svg>
    </div>
  </div>
  <div class="modal_divPlan">
    <div  class="modal_labalPlan" >
      <label for="modal_checkboxPlan">Планируемая операция
        <input class="modal_checkboxPlan" type="checkbox" id="modal_checkboxPlan">
        <span class="modal_customCheckbox"></span>
      </label>
    </div>

  </div>
  <div>
    <div class="modal_chooseImage">
      <input type="image">
    </div>    
    <div class="modal_divcolor">
      <input type="color" class="modal_inputcolor">
    </div>
  </div>
  <div class="modal_bottomButtonsAddOperation">
      <button  class="modal_arrowUP">
        <svg width="10" height="10" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M35 17.5C35 12.8587 33.1563 8.40752 29.8744 5.12563C26.5925 1.84374 22.1413 0 17.5 0C12.8587 0 8.40752 1.84374 5.12563 5.12563C1.84374 8.40752 0 12.8587 0 17.5C0 22.1413 1.84374 26.5925 5.12563 29.8744C8.40752 33.1563 12.8587 35 17.5 35C22.1413 35 26.5925 33.1563 29.8744 29.8744C33.1563 26.5925 35 22.1413 35 17.5ZM18.5938 25.1562C18.5938 25.4463 18.4785 25.7245 18.2734 25.9296C18.0683 26.1348 17.7901 26.25 17.5 26.25C17.2099 26.25 16.9317 26.1348 16.7266 25.9296C16.5215 25.7245 16.4062 25.4463 16.4062 25.1562V12.4841L11.7119 17.1806C11.5065 17.386 11.2279 17.5014 10.9375 17.5014C10.6471 17.5014 10.3685 17.386 10.1631 17.1806C9.95775 16.9752 9.84237 16.6967 9.84237 16.4062C9.84237 16.1158 9.95775 15.8373 10.1631 15.6319L16.7256 9.06938C16.8272 8.96752 16.9479 8.88671 17.0808 8.83157C17.2137 8.77643 17.3561 8.74804 17.5 8.74804C17.6439 8.74804 17.7863 8.77643 17.9192 8.83157C18.0521 8.88671 18.1728 8.96752 18.2744 9.06938L24.8369 15.6319C25.0423 15.8373 25.1576 16.1158 25.1576 16.4062C25.1576 16.6967 25.0423 16.9752 24.8369 17.1806C24.6315 17.386 24.3529 17.5014 24.0625 17.5014C23.7721 17.5014 23.4935 17.386 23.2881 17.1806L18.5938 12.4841V25.1562Z" fill="white"/>
        </svg>
      </button>
      <button class="modal_photoBtn">
        <svg width="35" height="1" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">
          <g clip-path="url(#clip0_4_746)">
            <path d="M22.9688 18.5938C22.9688 20.0442 22.3926 21.4352 21.367 22.4607C20.3414 23.4863 18.9504 24.0625 17.5 24.0625C16.0496 24.0625 14.6586 23.4863 13.633 22.4607C12.6074 21.4352 12.0313 20.0442 12.0312 18.5938C12.0313 17.1433 12.6074 15.7523 13.633 14.7268C14.6586 13.7012 16.0496 13.125 17.5 13.125C18.9504 13.125 20.3414 13.7012 21.367 14.7268C22.3926 15.7523 22.9688 17.1433 22.9688 18.5938Z" fill="black"/>
            <path d="M4.375 8.75C3.21468 8.75 2.10188 9.21094 1.28141 10.0314C0.460936 10.8519 0 11.9647 0 13.125L0 26.25C0 27.4103 0.460936 28.5231 1.28141 29.3436C2.10188 30.1641 3.21468 30.625 4.375 30.625H30.625C31.7853 30.625 32.8981 30.1641 33.7186 29.3436C34.5391 28.5231 35 27.4103 35 26.25V13.125C35 11.9647 34.5391 10.8519 33.7186 10.0314C32.8981 9.21094 31.7853 8.75 30.625 8.75H28.0613C26.901 8.74975 25.7884 8.28865 24.9681 7.46813L23.1569 5.65687C22.3366 4.83635 21.224 4.37525 20.0637 4.375H14.9362C13.776 4.37525 12.6634 4.83635 11.8431 5.65687L10.0319 7.46813C9.21159 8.28865 8.09898 8.74975 6.93875 8.75H4.375ZM5.46875 13.125C5.17867 13.125 4.90047 13.0098 4.69535 12.8046C4.49023 12.5995 4.375 12.3213 4.375 12.0312C4.375 11.7412 4.49023 11.463 4.69535 11.2579C4.90047 11.0527 5.17867 10.9375 5.46875 10.9375C5.75883 10.9375 6.03703 11.0527 6.24215 11.2579C6.44727 11.463 6.5625 11.7412 6.5625 12.0312C6.5625 12.3213 6.44727 12.5995 6.24215 12.8046C6.03703 13.0098 5.75883 13.125 5.46875 13.125ZM25.1562 18.5938C25.1562 20.6243 24.3496 22.5717 22.9138 24.0075C21.478 25.4434 19.5306 26.25 17.5 26.25C15.4694 26.25 13.522 25.4434 12.0862 24.0075C10.6504 22.5717 9.84375 20.6243 9.84375 18.5938C9.84375 16.5632 10.6504 14.6158 12.0862 13.18C13.522 11.7441 15.4694 10.9375 17.5 10.9375C19.5306 10.9375 21.478 11.7441 22.9138 13.18C24.3496 14.6158 25.1562 16.5632 25.1562 18.5938Z" fill="black"/>
          </g>
          <defs>
            <clipPath id="clip0_4_746">
              <rect width="35" height="35" fill="white"/>
            </clipPath>
          </defs>
        </svg>
      </button>
      <button @click="createOperationCassa()" class="modal_arrowDWN">
        <svg width="35" height="35" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M35 17.5C35 22.1413 33.1563 26.5925 29.8744 29.8744C26.5925 33.1563 22.1413 35 17.5 35C12.8587 35 8.40752 33.1563 5.12563 29.8744C1.84374 26.5925 0 22.1413 0 17.5C0 12.8587 1.84374 8.40752 5.12563 5.12563C8.40752 1.84374 12.8587 0 17.5 0C22.1413 0 26.5925 1.84374 29.8744 5.12563C33.1563 8.40752 35 12.8587 35 17.5ZM18.5938 9.84375C18.5938 9.55367 18.4785 9.27547 18.2734 9.07035C18.0683 8.86523 17.7901 8.75 17.5 8.75C17.2099 8.75 16.9317 8.86523 16.7266 9.07035C16.5215 9.27547 16.4062 9.55367 16.4062 9.84375V22.5159L11.7119 17.8194C11.5065 17.614 11.2279 17.4986 10.9375 17.4986C10.6471 17.4986 10.3685 17.614 10.1631 17.8194C9.95775 18.0248 9.84237 18.3033 9.84237 18.5938C9.84237 18.8842 9.95775 19.1627 10.1631 19.3681L16.7256 25.9306C16.8272 26.0325 16.9479 26.1133 17.0808 26.1684C17.2137 26.2236 17.3561 26.252 17.5 26.252C17.6439 26.252 17.7863 26.2236 17.9192 26.1684C18.0521 26.1133 18.1728 26.0325 18.2744 25.9306L24.8369 19.3681C25.0423 19.1627 25.1576 18.8842 25.1576 18.5938C25.1576 18.3033 25.0423 18.0248 24.8369 17.8194C24.6315 17.614 24.3529 17.4986 24.0625 17.4986C23.7721 17.4986 23.4935 17.614 23.2881 17.8194L18.5938 22.5159V9.84375Z" fill="white"/>
        </svg>

      </button>
  </div>
  </ModalWindow>
</div>
</template>

<script>
import Vue from 'vue'
import CassaOperation from '~/components/CassaOperation.vue';
import axios from '@/axios';
import ModalWindow from '~/components/ModalWindow.vue';


export default {
    layout: "empty",
    // props: {
        
    // },    
    data(){
      return{
        isModalAddOperationVisible: false,
      }
    },
    date(){
      return{
        cassaOperationsView: []
      }
    },
    mounted(){
      this.cassaOperationsView = []
      this.getcassaoperations()
      this.getOperationCassa(Vue.$cookiz.get('UserInfo'))
    },
    components: { CassaOperation, ModalWindow },
    methods:{
      async getOperationCassa(id){
        let promise = await new Promise ( (resolve, reject)=>{
            promise =axios({            
              method: 'GET',
              url:'operationCassa/getOperationCassa',
              params: id,
              })
              resolve(promise)
            })
        },
        openCassaList(){
            this.$router.push({name:'cassalist', path:'/cassalist', component: 'pages/cassalist'});
        },
        async getOperationsCassa(){
          let arr = []

           let promise = await new Promise ( (resolve, reject)=>{
            promise = axios.get( 'operationCassa/getOperationsCassa', {params:{ 
              CassaId: '08dad1c9-285a-4146-8365-cca928f45114'
              }
            });
            console.log('promise')
          console.log(promise)
          resolve(promise);
          })
          arr = promise.data.cassa
          for (const j in arr) {
            this.$set(this.cassaItems, j, arr[j])
            console.log(arr[j])
          }
          this.$forceUpdate();
        },
        createOperationCassa(){
          axios({
            method: 'POST',
            url:'operationCassa/createOperationCassa',
            data:{
              "operationType": "3fa85f64-5717-4562-b3fc-2c963f66afa5",
              "amount": 0,
              "amountUSD": 0,
              "amountEUR": 0,
              "courseUSD": 0,
              "courseEUR": 0,
              "isCash": true,
              "isExpense": true,
              "isPredict": true,
              "currencyType": 0,
              "description": "string",
              "created": "2022-11-14T08:28:50.091Z"
            }
          })
        },
        switchModalAdd(){
          if (this.isModalAddOperationVisible===true) {
            this.isModalAddOperationVisible=false;
          } else {
            this.isModalAddOperationVisible=true;
          }         
        },
    }
}
</script>

<style>
    @import "../assets/cassa_operation.scss";
    @import '../assets/cassalist.scss';
    @import "../assets/modalwindow.scss";
</style>
